app/controllers/favorites_controller.rb

	def index
		@favorites = current_user.favorites.all
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = $1  [["user_id", 1]]